/**------------------Динамічні маршрути--------------
Ми хочемо створити сторінку для перегляду деталей окремої нотатки. Для цього потрібно реалізувати динамічний маршрут – тобто сторінку, яка працює з різними id.

У Next.js структура маршруту базується на папках. Для динамічного маршруту використовується формат у квадратних дужках: */

//=============================================//

// const NoteDetails = () => {
//   return <div>NoteDetails</div>;
// };

// export default NoteDetails;

//============================================//
/**-----------Отримання id з URL----------

Next.js автоматично передає параметри маршруту у пропс params. В серверному компоненті params це проміс, тому перед ним потрібно додати await, щоб почекати поки він виконається зі значенням. */

// app/notes/[id]/page.tsx

type Props = {
  params: Promise<{ id: string }>;
};

const NoteDetails = async ({ params }: Props) => {
  const { id } = await params;
  console.log('note id:', id);

  return <div>NoteDetails</div>;
};

export default NoteDetails;
